wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/MicoDriverI2c.c
}

wiced_result_t wiced_i2c_init_tx_message(wiced_i2c_message_t* message, const void* tx_buffer, uint16_t  tx_buffer_length, uint16_t retries , wiced_bool_t disable_dma)
{
    if( ( message == 0 ) || ( tx_buffer == 0 ) || ( tx_buffer_length == 0 ) )
    {
        return WICED_BADARG;
    }
    memset(message, 0x00, sizeof(wiced_i2c_message_t));
    message->tx_buffer = tx_buffer;
    message->combined = WICED_FALSE;
    message->retries = retries;
    message->tx_length = tx_buffer_length;
    if( disable_dma )
    {
        message->flags = I2C_MESSAGE_NO_DMA;
    }
    else
    {
        message->flags = I2C_MESSAGE_USE_DMA;
    }
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_init_rx_message(wiced_i2c_message_t* message, void* rx_buffer, uint16_t  rx_buffer_length, uint16_t retries , wiced_bool_t disable_dma)
{
    if( ( message == 0 ) || ( rx_buffer == 0 ) || ( rx_buffer_length == 0 ) )
    {
        return WICED_BADARG;
    }
    memset(message, 0x00, sizeof(wiced_i2c_message_t));
    message->rx_buffer = rx_buffer;
    message->combined = WICED_FALSE;
    message->retries = retries;
    message->rx_length = rx_buffer_length;
    if( disable_dma )
    {
        message->flags = I2C_MESSAGE_NO_DMA;
    }
    else
    {
        message->flags = I2C_MESSAGE_USE_DMA;
    }
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_init_combined_message(wiced_i2c_message_t* message, const void* tx_buffer, void* rx_buffer, uint16_t tx_buffer_length, uint16_t rx_buffer_length, uint16_t retries , wiced_bool_t disable_dma)
{
    if( ( message == 0 ) || ( rx_buffer == 0 ) || ( tx_buffer == 0 ) || ( tx_buffer_length == 0 ) || ( rx_buffer_length == 0 ) )
    {
        return WICED_BADARG;
    }
    memset(message, 0x00, sizeof(wiced_i2c_message_t));
    message->rx_buffer = rx_buffer;
    message->tx_buffer = tx_buffer;
    message->combined = WICED_TRUE;
    message->retries = retries;
    message->tx_length = tx_buffer_length;
    message->rx_length = rx_buffer_length;
    if( disable_dma )
    {
        message->flags = I2C_MESSAGE_NO_DMA;
    }
    else
    {
        message->flags = I2C_MESSAGE_USE_DMA;
    }
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_transfer( wiced_i2c_device_t* device, wiced_i2c_message_t* messages, uint16_t number_of_messages )
{
    wiced_result_t result;
    int i = 0;

    wiced_assert( "bad argument", (device != NULL) && (messages != NULL) );

    MCU_CLOCKS_NEEDED();

    for( i=0; i < number_of_messages; i++ )
    {
        if( ( device->flags & I2C_DEVICE_USE_DMA ) && ( ( messages[i].flags & I2C_MESSAGE_USE_DMA ) == 1 ) )
        {
            result = i2c_dma_transfer(device, &messages[i]);
            if( result != WICED_SUCCESS )
            {
                MCU_CLOCKS_NOT_NEEDED();
                return WICED_ERROR;
            }
        }
        else
        {
            result = i2c_transfer_message_no_dma( device, &messages[i] );
            if( result != WICED_SUCCESS )
            {
                MCU_CLOCKS_NOT_NEEDED();
                return WICED_ERROR;
            }
        }
    }

    MCU_CLOCKS_NOT_NEEDED();
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_deinit( wiced_i2c_device_t* device )
{
    MCU_CLOCKS_NEEDED();

    /* Disable I2C peripheral clocks */
    RCC_APB1PeriphClockCmd( i2c_mapping[device->port].peripheral_clock_reg, DISABLE );

    /* Disable sda, scl gpio clocks */
    RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].pin_scl->peripheral_clock | i2c_mapping[device->port].pin_sda->peripheral_clock, DISABLE );

    /* Disable DMA */
    if( device->flags & I2C_DEVICE_USE_DMA )
    {
        DMA_DeInit( i2c_mapping[device->port].rx_dma_stream );
        DMA_DeInit( i2c_mapping[device->port].tx_dma_stream );
        RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].tx_dma_peripheral_clock, DISABLE );
    }

    MCU_CLOCKS_NOT_NEEDED();

    return WICED_SUCCESS;
}


